namespace Locations.LIB
{
    public static class Countries
    {
        public static Dictionary<string, Dictionary<string, string[]>> Locations = new Dictionary<string, Dictionary<string, string[]>>
        {
            { "Україна", new Dictionary<string, string[]>
                {
                { "Харків", new []{ "Харків", "Чугуїв", "Песочин", "Лозова", "Змиїв", "Дергачі" } },
                { "Київ", new []{ "Київ", "Буча", "Бровари", "Ірпінь", "Обухів", "Прип'ять", "Чорнобиль" } },
                { "Львів", new []{ "Львів", "Винники", "Миколаїв", "Перемишляни", "Трускавець", "Яворів" } },
                { "Івано-Франківськ", new []{ "Івано-Франківськ", "Коломия", "Снятин", "Яремче", "Тисмениця", "Болехів", "Бурштин", "Галич", "Долина", "Косів" } }
                }
            },
            { "Польша", new Dictionary<string, string[]>
                {
                { "Мазовецьке", new []{ "Варшава", "Радом", "Плоцьк", "Седльце", "Прушкув", "Остроленка" , "Легіоново", "Цеханув", "Отвоцьк", "Жирардув" } },
                { "Нижньосілезьке", new []{ "Вроцлав", "Валбжих", "Легниця", "Єленя-Ґура", "Любін", "Глогув", "Свідниця", "Болеславець" } },
                { "Люблінське", new []{ "Люблін", "Холм", "Замостя", "Біла", "Межиріччя" } },
                }
            },
            { "Америка", new Dictionary<string, string[]>
                {
                { "Айдахо", new []{ "Бойсе", "Нампа", "Меридиан", "Айдахо-Фолс", "Покателло", "Колдвелл", "Льюїстон", "Рексберґ", "Москоу", "Куна" } },
                { "Вашингтон", new []{ "Сиэтл", "Спокан", "Такома", "Ванкувер", "Белвью", "Эверетт", "Кент", "Лейквуд" } },
                { "Колорадо", new []{ "Денвер", " Арвада", "Боулдер", "Уэстминстер", "Колорадо-Спрингс", "Лейквуд", "Орора", "Пуэбло", "Сентенниал", "Торнтон", "Форт-Коллинс" } },
                { "Луизиана", new []{ "Батон-Руж", "Новый Орлеан" } },
                { "Миссури", new []{ "Джефферсон-Сити", "Сент-Луис", "Канзас-Сити", "Спрингфилд", "Колумбия" } },
                { "Мичиган", new []{ "Детройт", "Лансинг", "Дирборн", "Оберн-Хилс" } },
                { "Нью-Джерси", new []{ "Трентон", "Ньюарк", "Джерси-Сити", "Хакенсак" } },
                { "Огайо", new []{ "Колумбус", "Элирия","Кливленд", "Лейквуд", "Цинциннати", "Кайахога-Фолс", "Толидо", "Мидлтаун", "Акрон", "Юклид", "Дейтон", "Ньюарк", "Парма", "Мансфилд", "Кантон", "Кеттеринг" } },
                { "Техас", new []{ "Даллас", "Хьюстон", "Остин", "Ирвинг", "Арлингтон" } },
                }
            },
            { "Англія", new Dictionary<string, string[]>
                {
                { "Большой Лондон", new []{ "Лондон", "Вестминстер", "Уондсуэрт", "Хакни", "Ислингтон", "Энфилд", "Ньюэм", "Хаверинг", "Саттон" } },
                { "Северо-Западная Англия", new []{ "Манчестер", "Ливерпуль", "Саутпорт", "Блэкберн", "Бернли", "Уиган", "Блэкпул", "Престон" } },
                { "Восточная Англия", new []{ "Кембридж", "Норидж", "Харлоу", "Ипсуич", "Уотфорд", "Стивенидж", "Мэлдон" } },
                }
            },
            { "Китай", new Dictionary<string, string[]>
                {
                { "Гуандун", new []{ "Гуанчжоу", "Хэюань", "Цинъюань", "Янцзян", "Цзянмэнь", "Чжуншань", "Чжухай", "Шаньвэй"} },
                { "Ляонин", new []{ "Ляоян", "Цзиньчжоу", "Хулудао", "Фусинь", "Фушунь", "Даньдун", "Чаоян", "Бэньси", "Аньшань", "Далянь" , "Шэньян" } },
                { "Чжэцзян", new []{ "Нинбо", "Ханчжоу", "Хучжоу", "Цзясин", "Цзиньхуа", "Лишуй", "Цюйчжоу" } },
                { "Хубэй", new []{ "Ухань", "Эчжоу", "Хуанган", "Хуанши", "Цзинмэнь", "Цзинчжоу", "Шиянь", "Суйчжоу", "Сянъян", "Ичан" } },
                }
            },
            { "Японія", new Dictionary<string, string[]>
                {
                { "Хоккайдо", new []{ "Хакодате", "Кусиро", "Томакомай", "Обихиро", "Отару", "Китами", "Эбецу", "Титосе" } },
                { "Тохоку", new []{ "Акита", "Дайсен", "Йокоте", "Кадзуно", "Катагами", "Китаакита", "Никахо", "Носиро", "Ога", "Одате", "Сембоку", "Юдзава", "Юрихондзё" } },
                { "Канто", new []{ "Токио", "Оме", "Тама", "Татикава", "Тёфу", "Фусса", "Футю", "Хамура" } },
                { "Тюбу", new []{ "Имидзу", "Куробэ", "Намэрикава", "Нанто", "Хими", "Оябэ", "Такаока", "Тонами", "Тояма" } },
            }
            }
        };
    }
}
